cfd/templates/rhoCentralFoam_axisym/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// AETHER template - upper-case placeholders between at-signs are filled by aether.cfd.case.

application     rhoCentralFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         @N_ITERATIONS@;      // local time stepping: "time" is the iteration count
deltaT          1;

writeControl    timeStep;
writeInterval   @WRITE_INTERVAL@;
purgeWrite      2;
writeFormat     ascii;
writePrecision  10;
writeCompression off;
timeFormat      general;
timePrecision   8;
runTimeModifiable true;

adjustTimeStep  yes;
maxCo           @MAX_CO@;
maxDeltaT       1;
rDeltaTSmoothingCoeff @RDELTAT_SMOOTHING@;

functions
{
    forcesFore
    {
        type            forces;
        libs            (forces);
        patches         (body_fore);
        rho             rho;
        pRef            @P_INF@;     // so an isolated patch reports force relative to p_inf
        CofR            (0 0 0);
        writeControl    timeStep;
        writeInterval   @FORCE_INTERVAL@;
        log             false;
    }
@FORCES_AFT_BLOCK@
    ddtRho
    {
        type            ddt;
        libs            (fieldFunctionObjects);
        field           rho;
        result          ddtRho;
        executeControl  timeStep;
        executeInterval @FORCE_INTERVAL@;
        writeControl    none;
        log             false;
    }
    magDdtRho
    {
        type            mag;
        libs            (fieldFunctionObjects);
        field           ddtRho;
        result          magDdtRho;
        executeControl  timeStep;
        executeInterval @FORCE_INTERVAL@;
        writeControl    none;
        log             false;
    }
    residualRho
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        fields          (magDdtRho);
        operation       volAverage;
        regionType      all;
        writeFields     false;
        executeControl  timeStep;
        executeInterval @FORCE_INTERVAL@;
        writeControl    timeStep;
        writeInterval   @FORCE_INTERVAL@;
        log             false;
    }
}
