cfd/templates/rhoCentralFoam_axisym/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// AETHER template - upper-case placeholders between at-signs are filled by aether.cfd.case.

// Calorically perfect air, INVISCID (mu = 0 switches rhoCentralFoam to the Euler equations).
thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   @MOL_WEIGHT_G_MOL@;
    }
    thermodynamics
    {
        Cp          @CP_J_KGK@;
        Hf          0;
    }
    transport
    {
        mu          @MU_PA_S@;
        Pr          @PRANDTL@;
    }
}
