cfd/templates/rhoCentralFoam_axisym/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// AETHER template - upper-case placeholders between at-signs are filled by aether.cfd.case.

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform @P_INF@;

boundaryField
{
    freestream
    {
        type            fixedValue;
        value           uniform @P_INF@;
    }
    outlet
    {
        type            zeroGradient;
    }
    "body_.*"
    {
        type            zeroGradient;
    }
    "(front|back)"
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}
