cfd/templates/rhoCentralFoam_axisym/0.orig/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// AETHER template - upper-case placeholders between at-signs are filled by aether.cfd.case.

dimensions      [0 0 0 1 0 0 0];

internalField   uniform @T_INF@;

boundaryField
{
    freestream
    {
        type            fixedValue;
        value           uniform @T_INF@;
    }
    outlet
    {
        type            zeroGradient;
    }
    "body_.*"
    {
        type            zeroGradient;
    }
    "(front|back)"
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}
