cfd/templates/rhoCentralFoam_axisym/system/sampleLine
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleLine;
}
// AETHER template - upper-case placeholders between at-signs are filled by aether.cfd.case.

type            sets;
libs            (sampling);
interpolationScheme cell;          // raw cell values: no interpolation smearing the shock
setFormat       raw;
fields          (p rho T U);

sets
{
    stagnationLine
    {
        type    midPoint;
        axis    x;
        start   (@X_UPSTREAM@ @R_SAMPLE@ 0);
        end     (@X_NOSE@ @R_SAMPLE@ 0);
    }
}
